# JustifyType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
LayoutRuleClearSpacing..::..JustifyType Property
LayoutRuleClearSpacing Class See Also
---
Get or set the type of justification.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public BeamSystemJustifyType JustifyType { get; set; }
```

Visual Basic
---
```text
Public Property JustifyType As BeamSystemJustifyType
	Get
	Set
```

Visual C++
---
```text
public:
property BeamSystemJustifyType JustifyType {
	BeamSystemJustifyType get ();
	void set (BeamSystemJustifyType value);
}
```

# Remarks
The justifyType passed in must be a valid object.
# See Also
LayoutRuleClearSpacing Class
Autodesk.Revit.DB Namespace